Repository: ts-droid/RepCompanion_iOS
Catalog: RepCompanioniOS/Resources/Localizable.xcstrings
Source language: en
Languages: sv

source: No history yet
sv: Ingen historik än

source: No internet connection. Check your connection.
sv: Ingen internetanslutning. Kontrollera din uppkoppling.

source: No pending equipment
sv: Ingen väntande utrustning

source: No pending exercises
sv: Inga väntande övningar

source: No personal bests yet
sv: Inga personbästa än

source: No prompts found
sv: Ingen prompt funnen.

source: No training history yet
sv: Ingen träningshistorik än

source: No training programs
sv: Inga träningsprogram

source: No, just this set
sv: Nej, bara detta set

source: No, skip
sv: Nej, hoppa över

source: Not available
sv: Ej tillgänglig

source: Not specified
sv: Ej angivet

source: Not synced
sv: Ej synkad

source: Notes (optional)
sv: Anteckningar (valfritt)

source: Notification error
sv: Notifikationsfel

source: Notifications
sv: Notifikationer

source: Nutrition
sv: Kost

source: Ocean
sv: Hav

source: of
sv: av

source: of %@
sv: av %@

source: of goal
sv: av målet

source: One Rep Max (1RM)
sv: Maxvikt (1RM)

source: Ongoing Session
sv: Pågående Pass

source: Only developers have access to this view.
sv: Endast utvecklare har tillgång till denna vy.

source: Open Settings
sv: Öppna inställningar

source: optimal
sv: optimalt

source: Optimizing schedule...
sv: Optimerar schema...

source: Optional - helps us adapt weights
sv: Valfritt - hjälper oss att anpassa vikter

source: Or choose manually below
sv: Eller välj manuellt nedan

source: Or enter manually
sv: Eller ange manuellt

source: Other
sv: Annat

source: Overhead Press
sv: Stående press

source: Partner offer
sv: Partnererbjudande

source: Participating
sv: Deltar

source: Pause & Close
sv: Pausa & Stäng

source: Per workout
sv: Per träningspass

source: Personal best
sv: Personbästa

source: Personal Information
sv: Personlig information

source: Personal tips
sv: Personliga tips

source: Personal Training Program
sv: Personligt träningsprogram

source: Personal training programs
sv: Personliga träningsprogram

source: Personalized advice for your training
sv: Personliga råd för din träning

source: Pink
sv: Rosa

source: Plan your week
sv: Planera din vecka

source: Plank
sv: Plankan

source: Please enter your email
sv: Vänligen ange din e-post

source: Prepare your body for training
sv: Förbered kroppen för träning

source: Preparing your workout program...
sv: Förbereder ditt träningsprogram…

# Prestera i sport
source: Sports Performance
sv: Prestera i sport

source: Primary
sv: Primära

source: Privacy & Data Protection
sv: Sekretess & Dataskydd

source: Privacy and data handling
sv: Integritet och datahantering

source: Privacy Policy
sv: Sekretesspolicy

source: Private gyms are saved only for you.
sv: Privata gym sparas endast för dig.

source: Professional or competitive athlete
sv: Professionell eller tävlingsidrottare

source: Profile
sv: Profil

source: Program generated!
sv: Program skapat!

source: Program generation did not succeed at this time. Do you want to try again or continue without a program?
sv: Programgenereringen lyckades inte just nu. Vill du försöka igen eller fortsätta utan program?

source: Program generation did not succeed at this time. %@ Do you want to try again or continue without a program?
sv: Programgenereringen lyckades inte just nu. %@ Vill du försöka igen eller fortsätta utan program?

source: Program Generation Failed
sv: Programgenerering misslyckades

source: Program generation failed.
sv: Programgenerering misslyckades.

source: Program generation took too long. Please try again.
sv: Programgenereringen tog för lång tid. Vänligen försök igen.

source: Program management
sv: Programhantering

source: Prompts
sv: Prompt

source: Public gym
sv: Publikt gym

source: Public Gym
sv: Publikt gym

source: Pull Up
sv: Chins

source: Pull-up Bar
sv: Chinsräcke

source: Purple
sv: Lila

source: Push notifications
sv: Push-notifikationer

source: Quality
sv: Kvalitet

source: Queuing program generation...
sv: Köar programgenerering...

# rack
source: Squat Rack
sv: Skivstångsställning

source: Racks/Rigs
sv: Rack/Rigg

source: Read instructions
sv: Läs instruktioner

source: Reason (optional)
sv: Anledning (valfritt)

source: Recognizing equipment...
sv: Identifierar utrustning...

source: Recover from injury or illness.
sv: Återhämta dig efter skada eller sjukdom.

source: recovery
sv: återhämtning

source: Recovery
sv: Återhämtning

source: RECOVERY
sv: ÅTERHÄMTNING

source: RECOVERY DETAILS
sv: ÅTERHÄMTNINGSDETALJER

source: Remove ads
sv: Ta bort annonser

source: Remove ads for %@
sv: Ta bort annonser för %@

source: Restore purchase
sv: Återställ köp

source: Redo
sv: Gör om

source: Register equipment
sv: Registrera utrustning

source: Rehab/Recovery
sv: Rehab/Återhämtning

source: Rehabilitation
sv: Rehabilitering

# Rehabilitering
source: Rehabilitation
sv: Rehabilitering

source: Reject
sv: Avvisa

source: Remaining sets updated
sv: Återstående set uppdaterade

source: Remind me in 30 min
sv: Påminn om 30 min

source: Remove all programs and gyms to start over completely.
sv: Ta bort alla program och gym för att börja om helt.

source: RepCompanion cares about your privacy and handles personal data in accordance with GDPR
sv: RepCompanion värnar om din integritet och hanterar personuppgifter i enlighet med GDPR

source: RepCompanion contains ads and partnerships with third-party companies
sv: RepCompanion innehåller annonser och samarbeten med tredjepartsföretag

source: RepCompanion contains ads and partnerships with third-party companies. This means the app may show advertising, offers, or links to products and services.
sv: RepCompanion innehåller annonser och samarbeten med tredjepartsföretag. Detta innebär att appen kan visa reklam, erbjudanden eller länkar till produkter och tjänster.

source: RepCompanion is a simple and smart tool that helps you put together a training setup that fits your goals and daily life.
sv: RepCompanion är ett enkelt och smart verktyg som hjälper dig att sätta ihop ett träningsupplägg som passar dina mål och din vardag.

source: RepCompanion is a simple and smart tool that helps you set up
sv: RepCompanion är ett enkelt och smart verktyg som hjälper dig att sätta upp

source: RepCompanion is a training and planning app that provides general information, guidance, and suggestions about training and physical activity. The content in the app is intended for information and inspiration purposes and does not constitute medical advice or professional treatment.
sv: RepCompanion är en tränings- och planeringsapp som tillhandahåller generell information, vägledning och förslag kring träning och fysisk aktivitet. Innehållet i appen är avsedd för informations- och inspirationssyfte och utgör inte medicinsk rådgivning eller professionell behandling.

source: RepCompanion is a training and planning app that provides general recommendations
sv: RepCompanion är en tränings- och planeringsapp som tillhandahåller generella rekommendationer

source: RepCompanion values your privacy and handles personal data in accordance with applicable data protection legislation, including GDPR.
sv: RepCompanion värnar om din integritet och hanterar personuppgifter i enlighet med gällande dataskyddslagstiftning, inklusive GDPR.

source: Repetitions
sv: Repetitioner

source: Reps (e.g. 8-12)
sv: Reps (t.ex. 8-12)

source: Requires Apple Watch for activity
sv: Kräver Apple Watch för aktivitet

source: Requires Apple Watch for fitness
sv: Kräver Apple Watch för kondition

source: Requires Apple Watch for HRV
sv: Kräver Apple Watch för HRV

source: Requires Apple Watch for resting heart rate
sv: Kräver Apple Watch för vilopuls

source: Requires Apple Watch for workout
sv: Kräver Apple Watch för träningspass

source: Requires Apple Watch for workouts
sv: Kräver Apple Watch för träning

source: Reset
sv: Nollställ

source: Reset all
sv: Återställ allt

source: Reset onboarding
sv: Återställ onboarding

source: Reset the counter for your current program.
sv: Nollställ räknaren för ditt nuvarande program.

source: Reset to Session 1
sv: Börja om på Pass 1

source: Reset to Session 1?
sv: Börja om på Pass 1?

source: Rest
sv: Vila

source: Rest at least one day between intense sessions
sv: Vila minst en dag mellan intensiva pass

source: Rest before next set
sv: Vila innan nästa set

source: Resting heart rate
sv: Vilopuls

source: Running
sv: Löpning

source: Sat
sv: Lör

source: Saturday
sv: Lördag

source: Save
sv: Spara

source: Save changes
sv: Spara ändringar

source: Scan equipment
sv: Skanna utrustning

source: Search Distance
sv: Sökavstånd

source: Search exercise
sv: Sök övning

source: Search exercises...
sv: Sök övningar...

source: Search for nearby gyms
sv: Sök efter gym i närheten

source: Search gyms nearby
sv: Sök gym i närheten

source: Search nearby gyms
sv: Sök gym i närheten

source: Search video
sv: Sök video

source: Seated Row
sv: Sittande Rodd

source: Secondary
sv: Sekundära

source: seconds remaining
sv: sekunder kvar

source: See your health metrics over time
sv: Se dina hälsomätvärden över tid

source: Select a gym to get started
sv: Välj ett gym för att komma igång

source: Select another gym
sv: Välj annat gym

source: Select as active gym
sv: Välj som aktivt gym

source: Select equipment
sv: Välj utrustning

source: Select Equipment
sv: Välj utrustning

source: Select language
sv: Välj språk

source: Select metric
sv: Välj mätvärde

source: Select Theme
sv: Välj Tema

source: Send Magic Link
sv: Skicka Magic Link

source: Server did not respond. Please try again.
sv: Servern svarade inte. Försök igen.

source: Service Tests
sv: Servicetester

# Session %lld/%lld
source: Pass %1$lld/%2$lld
sv: Pass %lld/%lld

source: Session completed
sv: Pass avslutat

source: Session details
sv: Passdetaljer

source: Session duration: %lld minutes
sv: Passlängd: %lld minuter

source: Session length:
sv: Passlängd:

source: Session length: %lld minutes
sv: Passlängd: %lld minuter

source: sessions
sv: pass

source: Sessions
sv: Pass

source: Sessions per week: %lld
sv: Pass per vecka: %lld

source: Sessions this week
sv: Pass denna vecka

source: Sessions/week
sv: Pass/vecka

# Set %lld/%lld
source: Set %1$lld/%2$lld
sv: Set %lld/%lld

source: Set as active gym
sv: Välj som aktivt gym

source: Set completed
sv: Set avklarat

source: Set your daily step goal to track your activity
sv: Ställ in ditt dagliga stegmål för att spåra din aktivitet

source: Settings
sv: Inställningar

source: Sex
sv: Kön

source: Session %1$d/%2$d
sv: Pass %1$d/%2$d

source: Sets
sv: Set

source: Sets: %d
sv: Set: %d

source: Shop now
sv: Handla nu

source: Show
sv: Visa

source: Show all
sv: Visa alla

source: Sign in
sv: Logga in

source: Sign in could not be handled. Please try again.
sv: Inloggning kunde inte hanteras. Försök igen.

source: Sign in failed. Please try again.
sv: Inloggning misslyckades. Försök igen.

source: Sign in with Magic Link
sv: Logga in med Magic Link

source: Skip
sv: Hoppa över

source: Skip to next exercise
sv: Hoppa till nästa övning

source: Slate
sv: Skiffer

source: Sleep
sv: Sömn

source: Sleep (last night)
sv: Sömn (senaste natten)

source: Sleep 7-9 hours per night for optimal recovery
sv: Sov 7-9 timmar per natt för optimal återhämtning

source: Sleep:
sv: Sömn:

source: Smith Machine
sv: Smithmaskin

source: Social
sv: Socialt

source: Specific Sport
sv: Specifik idrott

source: Sports performance
sv: Prestera i sport

source: Squat
sv: Knäböj

source: Stairs
sv: Trappor

source: Standard location
sv: Standardplats

source: Start conservatively
sv: Börja konservativt

source: Start over at Session 1
sv: Börja om på Pass 1

source: Start over at Session 1?
sv: Börja om på Pass 1?

source: Start session
sv: Starta passet

source: Start training
sv: Börja träna

source: Statistics
sv: Statistik

source: steps
sv: steg

source: Steps
sv: Steg

source: Steps today
sv: Steg idag

source: Strength
sv: Styrka

source: Strength development
sv: Styrkeutveckling

source: Stretch trained muscle groups
sv: Stretcha tränade muskelgrupper

source: Summary
sv: Sammanfattning

source: Sun
sv: Sön

source: Sunday
sv: Söndag

source: Sunset
sv: Solnedgång

# Svenska
source: Swedish
sv: Svenska

source: Swimming
sv: Simning

source: Sync complete
sv: Synkning slutförd

source: Sync completed
sv: Synkning slutförd

source: Sync exercise catalog
sv: Synka övningskatalog

source: Sync health data
sv: Synka hälsodata

source: Sync now
sv: Synka nu

source: Sync to Watch (Debug)
sv: Synka till Watch (Debug)

source: Sync with HealthKit to see data
sv: Synka med HealthKit för att se data

source: Synced
sv: Synkad

source: Syncing
sv: Synkning

source: Syncing exercise catalog...
sv: Synkar övningskatalog...

source: Tags that refine your programming (max 3)
sv: Taggar som finjusterar din träning (max 3)

source: Technique
sv: Teknik

source: Terms
sv: Villkor

source: Terms & Privacy
sv: Villkor & Integritet

source: Terms of Service – RepCompanion
sv: Användarvillkor – RepCompanion

source: Terms of Use – RepCompanion
sv: Användarvillkor – RepCompanion

source: Test Results
sv: Test resultat

source: The program is ready but could not be loaded. Please try opening the app again.
sv: Programmet är klart men kunde inte laddas. Vänligen försök öppna appen igen.

source: The values above are suggestions based on your profile. You can change them if you know your exact 1RM values.
sv: Värdena ovan är förslag baserat på din profil. Du kan ändra dem om du vet dina exakta 1RM-värden.

source: This can take up to 2 minutes. Please be patient...
sv: Detta kan ta upp till 2 minuter. Ha lite tålamod...

source: This gym has not yet verified its equipment, therefore it is not selectable in the gym list. If you are at the gym, you can add it as a new gym, but you will need to select what equipment is available.
sv: Detta gym har än så länge inte verifierat utrustningen, därav är det inte valbart i gymlistan. Om du befinner dig på gymmet kan du lägga till det som nytt gym, men då måste du välja vilken utrustning som finns tillgänglig.

source: This gym has not yet verified its equipment, therefore it's not certain that all listed equipment is available.
sv: Detta gym har än så länge inte verifierat utrustningen, därav är det inte säkert att all utrustning som anges finns tillgänglig.

source: This helps us adapt the program
sv: Detta hjälper oss att anpassa programmet

source: This may take a moment. Analyzing your new goals and equipment.
sv: Detta kan ta en stund. Analyserar dina nya mål och utrustning.

source: This session appears to have no exercises. End the session and try syncing again.
sv: Detta pass verkar inte ha några övningar. Avsluta passet och prova att synka om.

source: This session doesn't seem to have any exercises. End the session and try syncing your program again.
sv: Detta pass verkar inte ha några övningar. Avsluta passet och prova att synka ditt program igen.

source: This session has no exercises yet
sv: Detta pass har inga övningar ännu

source: This will reset onboarding and you will need to go through onboarding again.
sv: Detta kommer att återställa onboarding och du kommer att behöva gå igenom onboarding igen.

source: This will reset onboarding and you will need to go through the settings again.
sv: Detta kommer att återställa onboarding och du kommer att behöva gå igenom inställningarna igen.

source: This will reset your counter to Session 1. Your existing training data will remain.
sv: Detta kommer att sätta din räknare till Pass 1. Dina befintliga träningsdata kommer att finnas kvar.

source: This will reset your counter to Session 1. Your existing training programs will not be deleted.
sv: Detta kommer att sätta din räknare till Pass 1. Dina befintliga träningsprogram raderas inte.

source: Thu
sv: Tors

source: Thursday
sv: Torsdag

# Tillbaka
source: Back
sv: Tillbaka

source: Time for warm-up!
sv: Dags för uppvärmning!

source: Time to train!
sv: Dags att träna!

source: Time to train! 💪
sv: Dags att träna! 💪

source: Tips & advice along the way
sv: Tips & råd längs vägen

source: Top exercises
sv: Toppövningar

source: Total calories
sv: Totala kalorier

source: Total sets
sv: Totala sets

source: Total steps
sv: Totala steg

source: Total volume
sv: Total volym

source: Total volume:
sv: Total volym:

source: Total activity:
sv: Total aktivitet:

source: Total recovery:
sv: Total återhämtning:

source: Track and Field
sv: Friidrott

source: Train safely
sv: Träna på ett säkert sätt

source: Train to perform better in your sport.
sv: Träna för att prestera bättre i din sport.

source: Trained consistently for 2+ years
sv: Tränat konsekvent i 2+ år

source: Trained regularly for 6+ months
sv: Tränat regelbundet i 6+ månader

source: Training frequency
sv: Träningsfrekvens

source: Training Frequency
sv: Träningsfrekvens

source: Training goals
sv: Träningsmål

source: Training Goals
sv: Träningsmål

source: Training heart rate
sv: Träningspuls

source: Training history
sv: Träningshistorik

source: Training program
sv: Träningsprogram

source: Training statistics
sv: Träningsstatistik

source: Tricep Pushdown
sv: Triceps Pushdown

source: Try again
sv: Försök igen

source: Try Again
sv: Försöka igen

source: Tue
sv: Tis

source: Tuesday
sv: Tisdag

source: Type
sv: Typ

source: Unique Exercises
sv: Unika Övningar

source: Unknown gym
sv: Okänt gym

source: Update remaining sets?
sv: Uppdatera återstående set?

source: Usage data about how the app features are used
sv: Användningsdata som rör hur appens funktioner används

source: Validating program...
sv: Validerar program...

source: Value
sv: Värde

source: Various training exercises
sv: Olika träningsövningar

source: Video instruction
sv: Videoinstruktion

source: View your health metrics over time
sv: Se dina hälsomätvärden över tid

source: Volume
sv: Volym

source: Waiting
sv: Väntar

source: Warm-up
sv: Uppvärmning

source: We can import your weight, height and age from Apple Health
sv: Vi kan hämta din vikt, längd och ålder från Apple Health

source: We need some information about you to adapt your training
sv: Vi behöver lite information om dig för att anpassa din träning

source: We'll send a link to your email that logs you in directly. No password needed!
sv: Vi skickar en länk till din e-post som loggar in dig direkt. Inget lösenord behövs!

source: We've sent a login link to **%@**. Click the link in the email to log in.
sv: Vi har skickat en inloggningslänk till **%@**. Klicka på länken i mejlet för att logga in.

source: Wed
sv: Ons

source: Wednesday
sv: Onsdag

source: Week
sv: Vecka

source: Week %lld
sv: Vecka %lld

source: Weight
sv: Vikt

source: Weight exceeds 330 kg. Please check your value.
sv: Vikt överstiger 330 kg. Vänligen kontrollera ditt angivna värde.

source: Weight is below 18 kg. Please check your value.
sv: Vikt understiger 18 kg. Vänligen kontrollera ditt angivna värde.

source: Weight Loss
sv: Viktminskning

source: Weight loss and health
sv: Viktminskning och hälsa

source: Weight progression
sv: Viktprogression

source: Welcome!
sv: Välkommen!

source: What information we collect:
sv: Vilken information vi samlar in:

source: What is your primary training goal?
sv: Vad är ditt primära träningsmål?

source: What is your training level?
sv: Vilken är din träningsnivå?

source: Where will you be training?
sv: Var kommer du att träna?

source: Whether you want to lose weight, rehabilitate an injury, or train for a sport
sv: Oavsett om du vill gå ner i vikt, rehabilitera en skada eller träna för en sport

source: Whether you want to lose weight, rehabilitate an injury, or train for ice hockey, we help you with the right focus.
sv: Oavsett om du vill gå ner i vikt, rehabilitera en skada eller träna för ishockey, hjälper vi dig med rätt fokus.

source: Which sport are you training for?
sv: Vilken sport tränar du för?

source: Workout
sv: Träningspass

source: Workout:
sv: Träningspass:

source: Workouts:
sv: Träningspass:

source: Year
sv: År

source: Yes, based on my program
sv: Ja, baserat på mitt program

source: Yes, let's go!
sv: Ja, nu kör vi!

source: Yes, update all
sv: Ja, uppdatera alla

source: You are not logged in
sv: Du är inte inloggad

source: You are not logged in. Please log in again.
sv: Du är inte inloggad. Vänligen logga in igen.

source: You are responsible for:
sv: Du ansvarar själv för att:

source: You have completed your entire workout!
sv: Du har genomfört hela ditt träningspass!

source: You've completed your entire workout!
sv: Du har genomfört hela ditt träningspass!

source: Your most trained exercises by volume
sv: Dina mest tränade övningar efter volym

source: Your program has the least focus on **%@**. Consider adding an exercise for better balance.
sv: Ditt program har lägst fokus på **%@**. Överväg att lägga till en övning för bättre balans.

source: Your training companion
sv: Din träningskompanjon

source: Your training plan is still being generated. We appreciate your patience!
sv: Din träningsplan genereras fortfarande. Vi uppskattar ditt tålamod!

source: Your workouts per week over time
sv: Dina träningspass per vecka över tid

source: your@email.com
sv: din@epost.se

source: Quit
sv: Avsluta

source: Quit & Save
sv: Avsluta & Spara

source: End workout
sv: Avsluta pass

source: Sports Performance
sv: Prestera i sport

source: Swedish
sv: Svenska

source: Total volyms: %@
sv: Total: %lld%%

source: Equipment:
sv: Utrustning:

source: Weight (kg)
sv: Vikt (kg)

source: Do you want to start %@s session today?
sv: Vill du starta %@s pass idag?
